app/controllers/recipes_controller.rb

SELECT "recipes".* FROM "recipes"  ORDER BY created_at DESC
---
  def index
  	@recipe = Recipe.all.order("created_at DESC")

INSERT INTO "recipes" ("title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Test"], ["description", "Test\r\n"], ["created_at", "2015-03-21 00:12:08.616420"], ["updated_at", "2015-03-21 00:12:08.616420"]]
---
  def create
  	@recipe = Recipe.new(recipe_params)

  	if @recipe.save

UPDATE "recipes" SET "description" = $1, "updated_at" = $2 WHERE "recipes"."id" = $3  [["description", "Test Test"], ["updated_at", "2015-03-21 00:26:53.809227"], ["id", 1]]
---
  def update
  	if @recipe.update(recipe_params)

DELETE FROM "recipes" WHERE "recipes"."id" = $1  [["id", 1]]
---
  def destroy
  	@recipe.destroy

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT 1  [["id", 1]]
---
  def find_recipe
  	@recipe = Recipe.find(params[:id])